Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1025DAK176.PIC
      <edc:SFRDef edc:_addr="0x1F84B028" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCCSS1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCCSS1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS0" edc:mask="0x1" edc:name="CSS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS1" edc:mask="0x1" edc:name="CSS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS2" edc:mask="0x1" edc:name="CSS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS3" edc:mask="0x1" edc:name="CSS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS4" edc:mask="0x1" edc:name="CSS4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS5" edc:mask="0x1" edc:name="CSS5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS6" edc:mask="0x1" edc:name="CSS6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS7" edc:mask="0x1" edc:name="CSS7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS8" edc:mask="0x1" edc:name="CSS8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS9" edc:mask="0x1" edc:name="CSS9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS10" edc:mask="0x1" edc:name="CSS10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS11" edc:mask="0x1" edc:name="CSS11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS12" edc:mask="0x1" edc:name="CSS12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS13" edc:mask="0x1" edc:name="CSS13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS14" edc:mask="0x1" edc:name="CSS14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS15" edc:mask="0x1" edc:name="CSS15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS16" edc:mask="0x1" edc:name="CSS16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS17" edc:mask="0x1" edc:name="CSS17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS18" edc:mask="0x1" edc:name="CSS18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS19" edc:mask="0x1" edc:name="CSS19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS20" edc:mask="0x1" edc:name="CSS20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS21" edc:mask="0x1" edc:name="CSS21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS22" edc:mask="0x1" edc:name="CSS22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS23" edc:mask="0x1" edc:name="CSS23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS24" edc:mask="0x1" edc:name="CSS24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS25" edc:mask="0x1" edc:name="CSS25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS26" edc:mask="0x1" edc:name="CSS26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS27" edc:mask="0x1" edc:name="CSS27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS28" edc:mask="0x1" edc:name="CSS28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS29" edc:mask="0x1" edc:name="CSS29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS30" edc:mask="0x1" edc:name="CSS30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS31" edc:mask="0x1" edc:name="CSS31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B02C" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="--------------------nnnnnnnnnnnn" edc:cname="ADCCSS2" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------000000000000" edc:name="ADCCSS2" edc:nzwidth="32" edc:por="--------------------000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSS32" edc:mask="0x1" edc:name="CSS32" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS33" edc:mask="0x1" edc:name="CSS33" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS34" edc:mask="0x1" edc:name="CSS34" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS35" edc:mask="0x1" edc:name="CSS35" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS36" edc:mask="0x1" edc:name="CSS36" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS37" edc:mask="0x1" edc:name="CSS37" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS38" edc:mask="0x1" edc:name="CSS38" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS39" edc:mask="0x1" edc:name="CSS39" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS40" edc:mask="0x1" edc:name="CSS40" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS41" edc:mask="0x1" edc:name="CSS41" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS42" edc:mask="0x1" edc:name="CSS42" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CSS43" edc:mask="0x1" edc:name="CSS43" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F84B030" edc:_begin="0x20" edc:_end="0x40" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1.Module" edc:_refcount="2" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ADCDSTAT1" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDSTAT1" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ARDY0" edc:mask="0x1" edc:name="ARDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY1" edc:mask="0x1" edc:name="ARDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY2" edc:mask="0x1" edc:name="ARDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY3" edc:mask="0x1" edc:name="ARDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY4" edc:mask="0x1" edc:name="ARDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY5" edc:mask="0x1" edc:name="ARDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY6" edc:mask="0x1" edc:name="ARDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY7" edc:mask="0x1" edc:name="ARDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY8" edc:mask="0x1" edc:name="ARDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY9" edc:mask="0x1" edc:name="ARDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY10" edc:mask="0x1" edc:name="ARDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY11" edc:mask="0x1" edc:name="ARDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY12" edc:mask="0x1" edc:name="ARDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY13" edc:mask="0x1" edc:name="ARDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY14" edc:mask="0x1" edc:name="ARDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY15" edc:mask="0x1" edc:name="ARDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY16" edc:mask="0x1" edc:name="ARDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY17" edc:mask="0x1" edc:name="ARDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY18" edc:mask="0x1" edc:name="ARDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY19" edc:mask="0x1" edc:name="ARDY19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY20" edc:mask="0x1" edc:name="ARDY20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY21" edc:mask="0x1" edc:name="ARDY21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY22" edc:mask="0x1" edc:name="ARDY22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY23" edc:mask="0x1" edc:name="ARDY23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY24" edc:mask="0x1" edc:name="ARDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY25" edc:mask="0x1" edc:name="ARDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY26" edc:mask="0x1" edc:name="ARDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY27" edc:mask="0x1" edc:name="ARDY27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY28" edc:mask="0x1" edc:name="ARDY28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY29" edc:mask="0x1" edc:name="ARDY29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY30" edc:mask="0x1" edc:name="ARDY30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARDY31" edc:mask="0x1" edc:name="ARDY31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
